gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot/Hardware/NET/net_mqttsn_message_operate.c
#if MQTTSN_MSG_VERSION_STREAM_TYPE == MQTTSN_MSG_VERSION_BYTE_STREAM

/**********************************************************************************************************
 @Function			void NET_MqttSN_FifoSendMessageInit(void)
 @Description			NET_MqttSN_FifoSendMessageInit	: 发送数据Fifo初始化
 @Input				void
 @Return				void
**********************************************************************************************************/
void NET_MqttSN_FifoSendMessageInit(void)
{
#if NETFIFOMESSAGETYPE == NETFIFOMESSAGEENABLE
	netMessageFifoInit(&NETMqttSNFifoMessageSendPark, MqttSNFifoMessageSendBuf, sizeof(MqttSNFifoMessageSendBuf), MESSAGEMQTTSNFIFO_SENDPARKNUM_MAX);
#endif
}

#if NETFIFOMESSAGETYPE == NETFIFOMESSAGEDISABLE
/**********************************************************************************************************
 @Function			bool NET_MqttSN_Message_SendDataisFull(void)
 @Description			NET_MqttSN_Message_SendDataisFull	: 检查发送队列是否已满
 @Input				void
 @Return				true							: 已满
					false						: 未满
**********************************************************************************************************/
bool NET_MqttSN_Message_SendDataisFull(void)
{
	bool MessageState;
	
	if ((NETMqttSNMessageSendPark.Rear + 1) % MQTTSN_SEND_PARK_NUM == NETMqttSNMessageSendPark.Front) {
		MessageState = true;
	}
	else {
		MessageState = false;
	}
	
	return MessageState;
}
#endif

/**********************************************************************************************************
 @Function			bool NET_MqttSN_Message_SendDataisEmpty(void)
 @Description			NET_MqttSN_Message_SendDataisEmpty	: 检查发送队列是否已空
 @Input				void
 @Return				true							: 已空
					false						: 未空
**********************************************************************************************************/
bool NET_MqttSN_Message_SendDataisEmpty(void)
{
#if NETFIFOMESSAGETYPE == NETFIFOMESSAGEDISABLE
	bool MessageState;
	
	if (NETMqttSNMessageSendPark.Front == NETMqttSNMessageSendPark.Rear) {
		MessageState = true;
	}
	else {
		MessageState = false;
	}
	
	return MessageState;
#endif
	
#if NETFIFOMESSAGETYPE == NETFIFOMESSAGEENABLE
	return netMessageFifoisEmpty(&NETMqttSNFifoMessageSendPark);
#endif
}

/**********************************************************************************************************
 @Function			void NET_MqttSN_Message_SendDataEnqueue(unsigned char* dataBuf, unsigned short dataLength)
 @Description			NET_MqttSN_Message_SendDataEnqueue	: 发送数据写入队列
 @Input				dataBuf	 		 			: 需写入数据
					dataLength					: 需写入数据长度
 @Return				void
**********************************************************************************************************/
void NET_MqttSN_Message_SendDataEnqueue(unsigned char* dataBuf, unsigned short dataLength)
{
#if NETFIFOMESSAGETYPE == NETFIFOMESSAGEDISABLE
	if ((dataBuf == NULL) || (dataLength > MQTTSN_SEND_BUFFER_SIZE)) {
		return;
	}
	
	NETMqttSNMessageSendPark.Rear = (NETMqttSNMessageSendPark.Rear + 1) % MQTTSN_SEND_PARK_NUM;				//队尾偏移1
	memset((u8 *)&NETMqttSNMessageSendPark.Park[NETMqttSNMessageSendPark.Rear], 0x0, sizeof(NETMqttSNMessageSendPark.Park[NETMqttSNMessageSendPark.Rear]));
	memcpy(NETMqttSNMessageSendPark.Park[NETMqttSNMessageSendPark.Rear].Buffer, dataBuf, dataLength);
	NETMqttSNMessageSendPark.Park[NETMqttSNMessageSendPark.Rear].Length = dataLength;
	
	if (NET_MqttSN_Message_SendDataisFull() == true) {												//队列已满
		NETMqttSNMessageSendPark.Front = (NETMqttSNMessageSendPark.Front + 1) % MQTTSN_SEND_PARK_NUM;			//队头偏移1
	}
#endif
	
#if NETFIFOMESSAGETYPE == NETFIFOMESSAGEENABLE
	netMessageFifoEnqueue(&NETMqttSNFifoMessageSendPark, dataBuf, dataLength);
#endif
}

/**********************************************************************************************************
 @Function			bool NET_MqttSN_Message_SendDataDequeue(unsigned char* dataBuf, unsigned short* dataLength)
 @Description			NET_MqttSN_Message_SendDataDequeue	: 发送数据读出队列
 @Input				dataBuf	 		 			: 需读出数据地址
					dataLength					: 需读出数据长度地址
 @Return				true							: 未空
					false						: 已空
**********************************************************************************************************/
bool NET_MqttSN_Message_SendDataDequeue(unsigned char* dataBuf, unsigned short* dataLength)
{
#if NETFIFOMESSAGETYPE == NETFIFOMESSAGEDISABLE
	bool MessageState;
	unsigned char front;
	
	if (NET_MqttSN_Message_SendDataisEmpty() == true) {												//队列已空
		MessageState = false;
	}
	else {																					//队列未空
		front = (NETMqttSNMessageSendPark.Front + 1) % MQTTSN_SEND_PARK_NUM;								//队头偏移1
		memcpy(dataBuf, NETMqttSNMessageSendPark.Park[front].Buffer, NETMqttSNMessageSendPark.Park[front].Length);
		*dataLength = NETMqttSNMessageSendPark.Park[front].Length;
		MessageState = true;
	}
	
	return MessageState;
#endif
	
#if NETFIFOMESSAGETYPE == NETFIFOMESSAGEENABLE
	return netMessageFifoDequeue(&NETMqttSNFifoMessageSendPark, dataBuf, dataLength);
#endif
}

/**********************************************************************************************************
 @Function			bool NET_MqttSN_Message_SendDataOffSet(void)
 @Description			NET_MqttSN_Message_SendDataOffSet	: 发送数据队列(队列头偏移1)
 @Input				void
 @Return				true							: 未空
					false						: 已空
**********************************************************************************************************/
bool NET_MqttSN_Message_SendDataOffSet(void)
{
#if NETFIFOMESSAGETYPE == NETFIFOMESSAGEDISABLE
	bool MessageState;
	
	if (NET_MqttSN_Message_SendDataisEmpty() == true) {												//队列已空
		MessageState = false;
	}
	else {																					//队列未空
		NETMqttSNMessageSendPark.Front = (NETMqttSNMessageSendPark.Front + 1) % MQTTSN_SEND_PARK_NUM;
		MessageState = true;
	}
	
	return MessageState;
#endif
	
#if NETFIFOMESSAGETYPE == NETFIFOMESSAGEENABLE
	return netMessageFifoDiscard(&NETMqttSNFifoMessageSendPark);
#endif
}

/**********************************************************************************************************
 @Function			unsigned char NET_MqttSN_Message_SendDataRear(void)
 @Description			NET_MqttSN_Message_SendDataRear	: 发送数据队尾值
 @Input				void
 @Return				发送数据队尾值
**********************************************************************************************************/
unsigned char NET_MqttSN_Message_SendDataRear(void)
{
#if NETFIFOMESSAGETYPE == NETFIFOMESSAGEDISABLE
	return NETMqttSNMessageSendPark.Rear;
#endif
	
#if NETFIFOMESSAGETYPE == NETFIFOMESSAGEENABLE
	return netMessageFifoRear(&NETMqttSNFifoMessageSendPark);
#endif
}

#endif

/********************************************** END OF FLEE **********************************************/
